STMicroelectronics/STM32CubeH7/Projects/STM32H7B3I-DK/Demonstrations/STemWin/Modules/video_player/video_player_app.c
/**
  ******************************************************************************
  * @file    videoplayer_app.c
  * @author  MCD Application Team
  * @brief   This file provides routines for JPEG decoding with DMA method.
******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "video_player_app.h"
#include "jpeg_utils.h"
#include "stm32h7b3i_discovery_lcd.h"
#include "GUI_AVI.h"

#include "cmsis_os.h"
/** @addtogroup VIDEO_PLAYER
  * @{
  */

/** @addtogroup VIDEO_PLAYER
  * @{
  */


/* Private typedef -----------------------------------------------------------*/
typedef struct hwjpeg_context_s {
    JPEG_HandleTypeDef hjpeg;
    uint8_t *input_buffer;
    uint32_t input_buffer_size;
    uint8_t *output_buffer;
    uint32_t output_buffer_size;
    uint32_t input_offset;
    uint32_t output_offset;
    uint8_t  enable_dma2d;
} hwjpeg_context_t;

/* Private define ------------------------------------------------------------*/
#define OUTPUT_THREAD_STACK_SIZE        (8 * configMINIMAL_STACK_SIZE)
#define OUTPUT_THREAD_PRIORITY          osPriorityNormal

#define DECODE_CONVERT_OUTPUT_BUFF      0x11

#define FRAME_BUFFER_WIDTH              480
#define FRAME_BUFFER_HEIGHT             272
#define RGB565_BYTES_PER_PIXEL          (uint32_t) (2U)

#define RGB_VIDEO_BUFFER_SIZE           ((uint32_t)(FRAME_BUFFER_WIDTH * FRAME_BUFFER_HEIGHT * RGB565_BYTES_PER_PIXEL)) /* 750 Kb */
#define RGB_VIDEO_BUFFER_NBR            2

/* Private macro -------------------------------------------------------------*/
#define container_of(ptr, type, member) \
        (struct hwjpeg_context_s *)( (char *)ptr - offsetof(type, member) )

/* Private variables ---------------------------------------------------------*/
static JPEG_YCbCrToRGB_Convert_Function pConvert_Function;
static hwjpeg_context_t hwjpeg_context;
static uint32_t DecodeBufferAddress , DisplayBufferAddress;

/* Buffers for right and left samples */
#if defined ( __GNUC__ )
__attribute__((section(".rgb_video_buffers"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="rgb_video_buffers"
#elif defined( __CC_ARM )
__attribute__((section(".rgb_video_buffers"), zero_init)) __attribute__ ((aligned (32)))
#endif
uint8_t VIDEO_RGBBuffer[RGB_VIDEO_BUFFER_NBR][RGB_VIDEO_BUFFER_SIZE] ;

static uint32_t MCU_BlockIndex = 0;
static osThreadId hOutputThread = 0;
static osMessageQId OutputEvent = 0;
static uint32_t MCU_TotalNb = 0;
static osSemaphoreId osVidSemph = 0;

JPEG_HandleTypeDef *JPEG_Handle = NULL;

extern uint8_t toggle_chromART;

/* Private function prototypes -----------------------------------------------*/
static void OutputThread(void const *argument);
extern void _LCD_DrawBitmap16bpp(int LayerIndex, int x, int y, U16 const * p, int xSize, int ySize, int BytesPerLine);
extern void DMA2D_CopyBuffer_YCbCr_To_RGB(int LayerIndex, const void * pSrc, const void * pDst, int xSize, int ySize, int aCssMode);

/* Private functions ---------------------------------------------------------*/

static void JPEG_ErrorCallback(JPEG_HandleTypeDef *hjpeg);
static void JPEG_InfoReadyCallback(JPEG_HandleTypeDef *hjpeg, JPEG_ConfTypeDef *pInfo);
static void JPEG_DecodeCpltCallback(JPEG_HandleTypeDef *hjpeg);
static void JPEG_DataReadyCallback (JPEG_HandleTypeDef *hjpeg, uint8_t *pDataOut, uint32_t OutDataLength);
static void JPEG_GetDataCallback(JPEG_HandleTypeDef *hjpeg, uint32_t NbDecodedData);

/**
  * @brief  Init HArdware Decoder
  * @param  None
  * @retval None
  */
void HW_JPEG_Init(void)
{
  hwjpeg_context.hjpeg.Instance = JPEG;
  hwjpeg_context.hjpeg.MspInitCallback = NULL;
  hwjpeg_context.hjpeg.MspDeInitCallback = NULL;

  HAL_JPEG_Init(&hwjpeg_context.hjpeg);

  /* Setup custom callbacks */
  hwjpeg_context.hjpeg.InfoReadyCallback  = JPEG_InfoReadyCallback;
  hwjpeg_context.hjpeg.DecodeCpltCallback = JPEG_DecodeCpltCallback;
  hwjpeg_context.hjpeg.ErrorCallback      = JPEG_ErrorCallback;
  hwjpeg_context.hjpeg.GetDataCallback    = JPEG_GetDataCallback;
  hwjpeg_context.hjpeg.DataReadyCallback  = JPEG_DataReadyCallback;

  /* Initialize Decode and Display Buffers */
  DecodeBufferAddress = (uint32_t )&VIDEO_RGBBuffer[0];
  DisplayBufferAddress = (uint32_t )&VIDEO_RGBBuffer[0];
  
  /* Output FRAME Queue */
  osMessageQDef(OUTPUT_Queue, 6, uint16_t);
  OutputEvent = osMessageCreate (osMessageQ(OUTPUT_Queue), NULL); 
 
  /* Create the Semaphore used by the two threads */
  /* Create Semaphore lock */
  osSemaphoreDef(Semaphore);
  osVidSemph = osSemaphoreCreate(osSemaphore(Semaphore), 1);

  /* Output Thread  definition */
  osThreadDef(OUTPUT_THREAD, OutputThread, OUTPUT_THREAD_PRIORITY, 0, OUTPUT_THREAD_STACK_SIZE);
  hOutputThread = osThreadCreate(osThread(OUTPUT_THREAD), NULL);

  /* Public handle referenced in stm32h7xx_it.c */
  JPEG_Handle = &hwjpeg_context.hjpeg;

  JPEG_InitColorTables();
}


/**
  * @brief  Stop HArdware Decoder
  * @param  None
  * @retval None
  */
void HW_JPEG_DeInit(void)
{ 
  HAL_JPEG_DeInit(&hwjpeg_context.hjpeg);
  
  if(hOutputThread)
  {
    osThreadTerminate(hOutputThread);
    hOutputThread = 0;
  }
  
  if(osVidSemph)
  {
    osSemaphoreDelete(osVidSemph);
    osVidSemph = 0;
  }
  
  if(OutputEvent)
  {
    vQueueDelete(OutputEvent); 
    OutputEvent = 0;  
  }
}

/**
  * @brief  Output Jpeg task
  * @param  None
  * @retval None
  */
static void OutputThread(void const *argument)
{
  osEvent event;
  
  for(;;)
  {
    event = osMessageGet(OutputEvent, osWaitForever );
    
    if( event.status == osEventMessage )
    {
      switch(event.value.v)
      {
        case DECODE_CONVERT_OUTPUT_BUFF:
          if(hwjpeg_context.enable_dma2d == 1)
          {
            DMA2D_CopyBuffer_YCbCr_To_RGB(0, (const void *)DisplayBufferAddress, NULL, 480, 272, DMA2D_CSS_420);
            DisplayBufferAddress = (DisplayBufferAddress == (uint32_t )&VIDEO_RGBBuffer[1] ? (uint32_t )&VIDEO_RGBBuffer[0] : (uint32_t )&VIDEO_RGBBuffer[1]);
          }
          else
          {
            uint32_t ConvertedDataCount;
            MCU_BlockIndex += pConvert_Function( (uint8_t *)DecodeBufferAddress, (uint8_t *)DisplayBufferAddress, MCU_BlockIndex, MAX_CHUNK_SIZE, &ConvertedDataCount);
            if((MCU_BlockIndex == MCU_TotalNb) && (MCU_TotalNb != 0))
            {
              _LCD_DrawBitmap16bpp(0, 0, 0, (uint16_t *)DisplayBufferAddress, 480, 272, 960);
              DisplayBufferAddress = (DisplayBufferAddress == (uint32_t )&VIDEO_RGBBuffer[1] ? (uint32_t )&VIDEO_RGBBuffer[0] : (uint32_t )&VIDEO_RGBBuffer[1]);
            }
            else
            {
              HAL_JPEG_Resume(&hwjpeg_context.hjpeg, JPEG_PAUSE_RESUME_OUTPUT); 
            }
          }
          break;
      }
    }
  }
}

/**
  * @brief  Decode_DMA
  * @param hjpeg: JPEG handle pointer
  * @param  FileName    : jpg file path for decode.
  * @param  DestAddress : ARGB destination Frame Buffer Address.
  * @retval None
  */
U32 HW_JPEG_Draw (const void * pFileData, U32 DataSize, U32 x0, U32 y0)
{
  HAL_StatusTypeDef ret = HAL_TIMEOUT;

  if (osVidSemph)
  {
    if (osSemaphoreWait(osVidSemph, osWaitForever) == osErrorOS)
      return ret;
  }

  MCU_BlockIndex = 0;
  MCU_TotalNb = 0;

  /* Set the Decoder buffer */
  DecodeBufferAddress = (DecodeBufferAddress == (uint32_t )&VIDEO_RGBBuffer[1]) ? (uint32_t )&VIDEO_RGBBuffer[0] : (uint32_t )&VIDEO_RGBBuffer[1];

  /* Initialize decode context */
  hwjpeg_context.enable_dma2d = toggle_chromART;
  hwjpeg_context.input_buffer = (uint8_t*)pFileData;
  hwjpeg_context.input_buffer_size = (DataSize + 31) &~31;
  hwjpeg_context.output_buffer = (uint8_t*)DecodeBufferAddress;
  hwjpeg_context.output_buffer_size = MAX_CHUNK_SIZE;
  hwjpeg_context.input_offset = 0;
  hwjpeg_context.output_offset = 0;

  ret = HAL_JPEG_Decode_DMA(&hwjpeg_context.hjpeg,
                             hwjpeg_context.input_buffer, MAX_CHUNK_SIZE,
                             hwjpeg_context.output_buffer, MAX_CHUNK_SIZE);

  return ret;
}

static void JPEG_GetDataCallback(JPEG_HandleTypeDef *hjpeg, uint32_t NbDecodedData)
{
  struct hwjpeg_context_s *context =
    container_of(hjpeg, struct hwjpeg_context_s, hjpeg);

  context->input_offset += NbDecodedData;

  int length = context->input_buffer_size - context->input_offset;

  if (length > 0)
  {
    int size = (length + 4) > MAX_CHUNK_SIZE ? MAX_CHUNK_SIZE : length;

    HAL_JPEG_ConfigInputBuffer(hjpeg,
                               context->input_buffer
                                   + context->input_offset, size);
  }
  else
  {
    HAL_JPEG_ConfigInputBuffer(hjpeg,
                               context->input_buffer
                                   + context->input_offset, 0);
  }
}

/**
  * @brief  JPEG Data Ready callback
  * @param hjpeg: JPEG handle pointer
  * @param pDataOut: pointer to the output data buffer
  * @param OutDataLength: length of output buffer in bytes
  * @retval None
  */
static void JPEG_DataReadyCallback (JPEG_HandleTypeDef *hjpeg, uint8_t *pDataOut, uint32_t OutDataLength)
{
  if (hwjpeg_context.enable_dma2d == 1)
  {
    struct hwjpeg_context_s *context = container_of(hjpeg, struct hwjpeg_context_s, hjpeg);
  
    context->output_offset += OutDataLength;
  
    HAL_JPEG_ConfigOutputBuffer(hjpeg,
                                context->output_buffer
                                    + context->output_offset,
                                MAX_CHUNK_SIZE);
  }
  else
  {
    SCB_InvalidateDCache_by_Addr((uint32_t*)pDataOut, MAX_CHUNK_SIZE);
    HAL_JPEG_Pause(hjpeg, JPEG_PAUSE_RESUME_OUTPUT);
    HAL_JPEG_ConfigOutputBuffer(hjpeg, (uint8_t*)DecodeBufferAddress, MAX_CHUNK_SIZE);
  
    if (OutputEvent)
        osMessagePut(OutputEvent, DECODE_CONVERT_OUTPUT_BUFF, 0); /* For software YCbCr/RGB conversion */
  }
}

/**
  * @brief  JPEG Decode complete callback
  * @param hjpeg: JPEG handle pointer
  * @retval None
  */
static void JPEG_DecodeCpltCallback(JPEG_HandleTypeDef *hjpeg)
{
  if(hwjpeg_context.enable_dma2d == 1)
  {
    if (OutputEvent)
      osMessagePut(OutputEvent, DECODE_CONVERT_OUTPUT_BUFF, 0);
  }

  if (osVidSemph)
  {
    osSemaphoreRelease(osVidSemph);
  }
}

/**
  * @brief  JPEG Info ready callback
  * @param hjpeg: JPEG handle pointer
  * @param pInfo: JPEG Info Struct pointer
  * @retval None
  */
static void JPEG_InfoReadyCallback(JPEG_HandleTypeDef *hjpeg, JPEG_ConfTypeDef *pInfo)
{
  if(hwjpeg_context.enable_dma2d == 0)
  {
    if(JPEG_GetDecodeColorConvertFunc(pInfo, &pConvert_Function, &MCU_TotalNb) == HAL_OK)
    {
    }
  }
}

static void JPEG_ErrorCallback(JPEG_HandleTypeDef *hjpeg)
{
  configASSERT (0);
}


/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
